loadtest.yml
config:
  target: 'http://localhost:8001'
  processor: './loadtestFunc.js'
  phases:
    - duration: 60
      arrivalCount: 5 #4RPS
      name: 'Warm up the application'
    # - duration: 60
    #   arrivalCount: 500 #12RPS
    #   name: 'ramp up phase'
    # - duration: 60
    #   arrivalRate: 10
    #   rampTo: 40
    #   name: 'push limits'
    # - duration: 60
    #   arrivalRate: 80
    #   name: 'sustained heavy load'
scenarios:
  - flow:
    - loop:
      - function: 'generateRandomProduct'
      - get:
          url: "/shoes/{{ product }}"
      - get:
          url: "/shares/{{ product }}"
      - get:
          url: "/shoes"
      count: 10